jet_in_flow/icoFoamColored_laminar_nonmixing/U1_0_1_U2_0_6_long/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|  Jet-in-crossflow: 2×1×1 box + 0.2×0.2 duct 0.2 m below floor (−z)         |
|  Parametric, human-readable, 3×3 main blocks + 1 duct block                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

// ---------------- Parameters ----------------
jetWidth    0.00375;    // square jet opening
jetDepth    0.01;       // duct depth below floor
Lx          0.05;       // domain length (x)
Lz          0.01125;    // domain height (z)
Ly          0.01125;    // domain width  (y)
centerX     0.01125;    // jet center (x)
centerY     0.005625;   // jet center (y)

// mesh resolution (balanced & matching at interfaces)
nx_left  24;
nx_right 80;
ny  24;   // spanwise
nz  24;   // vertical
nJetX  8;
nDuctZ 24;   // duct cells along z

// -------------- Derived coords --------------
x0  0;
x1  #calc "$centerX - 0.5*$jetWidth";
x2  #calc "$centerX + 0.5*$jetWidth";
x3  $Lx;

y0  0;
y1  #calc "$centerY - 0.5*$jetWidth";
y2  #calc "$centerY + 0.5*$jetWidth";
y3  $Ly;

z0  0;
z1  $Lz;
zD  #calc "-$jetDepth";

// ---------------- Vertices ------------------
vertices
(
    // floor z=0
    ($x0 $y0 $z0)  //  0
    ($x1 $y0 $z0)  //  1
    ($x2 $y0 $z0)  //  2
    ($x3 $y0 $z0)  //  3

    ($x0 $y1 $z0)  //  4
    ($x1 $y1 $z0)  //  5
    ($x2 $y1 $z0)  //  6
    ($x3 $y1 $z0)  //  7

    ($x0 $y2 $z0)  //  8
    ($x1 $y2 $z0)  //  9
    ($x2 $y2 $z0)  // 10
    ($x3 $y2 $z0)  // 11

    ($x0 $y3 $z0)  // 12
    ($x1 $y3 $z0)  // 13
    ($x2 $y3 $z0)  // 14
    ($x3 $y3 $z0)  // 15

    // top z=1
    ($x0 $y0 $z1)  // 16
    ($x1 $y0 $z1)  // 17
    ($x2 $y0 $z1)  // 18
    ($x3 $y0 $z1)  // 19

    ($x0 $y1 $z1)  // 20
    ($x1 $y1 $z1)  // 21
    ($x2 $y1 $z1)  // 22
    ($x3 $y1 $z1)  // 23

    ($x0 $y2 $z1)  // 24
    ($x1 $y2 $z1)  // 25
    ($x2 $y2 $z1)  // 26
    ($x3 $y2 $z1)  // 27

    ($x0 $y3 $z1)  // 28
    ($x1 $y3 $z1)  // 29
    ($x2 $y3 $z1)  // 30
    ($x3 $y3 $z1)  // 31

    // duct bottom ring at z = zD (below floor opening)
    ($x1 $y1 $zD)  // 32
    ($x2 $y1 $zD)  // 33
    ($x2 $y2 $zD)  // 34
    ($x1 $y2 $zD)  // 35
);

// ---------------- Blocks --------------------
blocks
(
    // LOGIC: hex (v0 v1 v2 v3 v4 v5 v6 v7) (nx ny nz)
    // Axis 1 (v0->v1) = Global X  (nx)
    // Axis 2 (v1->v2) = Global Y  (ny)
    // Axis 3 (v0->v4) = Global Z  (nz)

    // --- ROW 1 (Bottom, Y = y0 to y1) ---
    hex ( 0  1  5  4  16 17 21 20) ($nx_left  $ny $nz) simpleGrading (1 1 1)
    hex ( 1  2  6  5  17 18 22 21) ($nJetX    $ny $nz) simpleGrading (1 1 1)
    hex ( 2  3  7  6  18 19 23 22) ($nx_right $ny $nz) simpleGrading (1 1 1)

    // --- ROW 2 (Middle, Y = y1 to y2) ---
    hex ( 4  5  9  8  20 21 25 24) ($nx_left  $ny $nz) simpleGrading (1 1 1)
    hex ( 5  6 10  9  21 22 26 25) ($nJetX    $ny $nz) simpleGrading (1 1 1)
    hex ( 6  7 11 10  22 23 27 26) ($nx_right $ny $nz) simpleGrading (1 1 1)

    // --- ROW 3 (Top, Y = y2 to y3) ---
    hex ( 8  9 13 12  24 25 29 28) ($nx_left  $ny $nz) simpleGrading (1 1 1)
    hex ( 9 10 14 13  25 26 30 29) ($nJetX    $ny $nz) simpleGrading (1 1 1)
    hex (10 11 15 14  26 27 31 30) ($nx_right $ny $nz) simpleGrading (1 1 1)

    // --- DUCT (Below Floor) ---
    // Axis 1 (X): 32->33
    // Axis 2 (Y): 33->34
    // Axis 3 (Z): 32->5
    hex (32 33 34 35   5  6 10  9) ($nJetX $ny $nDuctZ) simpleGrading (1 1 1)
);

edges ();

// --------------- Boundaries ----------------
boundary
(
    inletMain
    {
        type patch;     // x = 0
        faces ((0 16 20 4) (4 20 24 8) (8 24 28 12));
    }
    outlet
    {
        type patch;     // x = Lx
        faces ((3 7 23 19) (7 11 27 23) (11 15 31 27));
    }
    top
    {
        type wall;      // z = Lz
        faces
        (
            (16 17 21 20) (20 21 25 24) (24 25 29 28)
            (17 18 22 21) (21 22 26 25) (25 26 30 29)
            (18 19 23 22) (22 23 27 26) (26 27 31 30)
        );
    }
    jetInlet
    {
        type patch;     // bottom of duct (z = zD)
        faces ((32 33 34 35));
    }
    floor
    {
        type wall;      // z = 0 (excluding the hole)
        faces
        (
            (0 1 5 4) (4 5 9 8) (8 9 13 12)
            (1 2 6 5)          (9 10 14 13)
            (2 3 7 6) (6 7 11 10) (10 11 15 14)
        );
    }
    sideWalls
    {
        type wall;      // y = 0 and y = Ly
        faces
        (
            (0 16 17 1) (1 17 18 2) (2 18 19 3)
            (12 28 29 13) (13 29 30 14) (14 30 31 15)
        );
    }
);

// four duct side faces default to wall:
defaultPatch { name ductWalls; type wall; }

mergePatchPairs();

